days_from_num_to_full_text = {0: "Понедельник", 1: "Вторник", 2: "Среда", 3: "Четверг", 4: "Пятница", 5: "Суббота"}
days_from_num_to_full_text_formatted = {0: "Понедельник", 1: "Вторник", 2: "Среду", 3: "Четверг", 4: "Пятницу",
                                        5: "Субботу"}
days_from_short_text_to_num = {'Пн': 0, 'Вт': 1, 'Ср': 2, 'Чт': 3, 'Пт': 4, 'Сб': 5}
days_from_short_text_to_full = {"Пн": "Понедельник", "Вт": "Вторник", "Ср": "Среда", "Чт": "Четверг", "Пт": "Пятница", "Сб": "Суббота"}

lessons_keys = {'0️⃣-й урок, 8:30 - 8:55:\r\n': '0\r\n08:30 - 08:55',
                '1️⃣-й урок, 9:00 - 9:45:\r\n': '1\r\n09:00 - 09:45',
                '2️⃣-й урок, 9:55 - 10:40:\r\n': '2\r\n09:55 - 10:40',
                '3️⃣-й урок, 10:50 - 11:35:\r\n': '3\r\n10:50 - 11:35',
                '4️⃣-й урок, 11:45 - 12:30:\r\n': '4\r\n11:45 - 12:30',
                '5️⃣-й урок, 12:50 - 13:35:\r\n': '5\r\n12:50 - 13:35',
                '6️⃣-й урок, 13:55 - 14:40:\r\n': '6\r\n13:55 - 14:40',
                '7️⃣-й урок, 14:50 - 15:35:\r\n': '7\r\n14:50 - 15:35',
                '8️⃣-й урок, 15:45 - 16:30:\r\n': '8\r\n15:45 - 16:30'}

for_datetime = {'0\r\n08:30 - 08:55': ((8, 20),
                                     (8, 55)),
                '1\r\n09:00 - 09:45': ((8, 55),
                                     (9, 45)),
                '2\r\n09:55 - 10:40': ((9, 45),
                                     (10, 40)),
                '3\r\n10:50 - 11:35': ((10, 40),
                                     (11, 35)),
                '4\r\n11:45 - 12:30': ((11, 35),
                                     (12, 30)),
                '5\r\n12:50 - 13:35': ((12, 30),
                                     (13, 35)),
                '6\r\n13:55 - 14:40': ((13, 35),
                                     (14, 40)),
                '7\r\n14:50 - 15:35': ((14, 40),
                                     (15, 35)),
                '8\r\n15:45 - 16:30': ((15, 35),
                                     (16, 30))}

path_to_timetables = 'timetables/'
path_to_changes = 'changes_tt/'
path_to_timetables_csv = 'timetables_csv/'

COMMANDS = {'start': 'end',
            'edit': 'end_edit',
            'mail': 'end_mail',
            'load': 'end_load',
            'changes': 'end_changes',
            'extra': 'end_extra',
            'give': 'end_give',
            'take': 'end_take',
            'check': 'end_check',
            'sticker': 'end_sticker'}
